Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF2682.PIC
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB1SIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1SIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF51">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXB1SID3" edc:desc="" edc:mask="0x1" edc:name="RXB1SID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1SID4" edc:desc="" edc:mask="0x1" edc:name="RXB1SID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1SID5" edc:desc="" edc:mask="0x1" edc:name="RXB1SID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1SID6" edc:desc="" edc:mask="0x1" edc:name="RXB1SID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1SID7" edc:desc="" edc:mask="0x1" edc:name="RXB1SID7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1SID8" edc:desc="" edc:mask="0x1" edc:name="RXB1SID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1SID9" edc:desc="" edc:mask="0x1" edc:name="RXB1SID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1SID10" edc:desc="" edc:mask="0x1" edc:name="RXB1SID10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrr-rr" edc:cname="RXB1SIDL" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuu0uu" edc:name="RXB1SIDL" edc:nzwidth="0x8" edc:por="xxxxx0xx" edc:_addr="0xF52">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXID" edc:desc="" edc:mask="0x1" edc:name="EXID" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SRR" edc:desc="" edc:mask="0x1" edc:name="SRR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXB1EID16" edc:desc="" edc:mask="0x1" edc:name="RXB1EID16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1EID17" edc:desc="" edc:mask="0x1" edc:name="RXB1EID17" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1EXID" edc:desc="" edc:mask="0x1" edc:name="RXB1EXID" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1SRR" edc:desc="" edc:mask="0x1" edc:name="RXB1SRR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1SID0" edc:desc="" edc:mask="0x1" edc:name="RXB1SID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1SID1" edc:desc="" edc:mask="0x1" edc:name="RXB1SID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1SID2" edc:desc="" edc:mask="0x1" edc:name="RXB1SID2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB1EIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1EIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF53">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXB1EID8" edc:desc="" edc:mask="0x1" edc:name="RXB1EID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1EID9" edc:desc="" edc:mask="0x1" edc:name="RXB1EID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1EID10" edc:desc="" edc:mask="0x1" edc:name="RXB1EID10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1EID11" edc:desc="" edc:mask="0x1" edc:name="RXB1EID11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1EID12" edc:desc="" edc:mask="0x1" edc:name="RXB1EID12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1EID13" edc:desc="" edc:mask="0x1" edc:name="RXB1EID13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1EID14" edc:desc="" edc:mask="0x1" edc:name="RXB1EID14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1EID15" edc:desc="" edc:mask="0x1" edc:name="RXB1EID15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB1EIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1EIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF54">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXB1EID0" edc:desc="" edc:mask="0x1" edc:name="RXB1EID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1EID1" edc:desc="" edc:mask="0x1" edc:name="RXB1EID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1EID2" edc:desc="" edc:mask="0x1" edc:name="RXB1EID2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1EID3" edc:desc="" edc:mask="0x1" edc:name="RXB1EID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1EID4" edc:desc="" edc:mask="0x1" edc:name="RXB1EID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1EID5" edc:desc="" edc:mask="0x1" edc:name="RXB1EID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1EID6" edc:desc="" edc:mask="0x1" edc:name="RXB1EID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1EID7" edc:desc="" edc:mask="0x1" edc:name="RXB1EID7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-rrrrrrr" edc:cname="RXB1DLC" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0uuuuuuu" edc:name="RXB1DLC" edc:nzwidth="0x8" edc:por="0xxxxxxx" edc:_addr="0xF55">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DLC0" edc:desc="" edc:mask="0x1" edc:name="DLC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC1" edc:desc="" edc:mask="0x1" edc:name="DLC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC2" edc:desc="" edc:mask="0x1" edc:name="DLC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC3" edc:desc="" edc:mask="0x1" edc:name="DLC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0" edc:desc="" edc:mask="0x1" edc:name="RB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB1" edc:desc="" edc:mask="0x1" edc:name="RB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXRTR" edc:desc="" edc:mask="0x1" edc:name="RXRTR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="RESRB0" edc:desc="" edc:mask="0x1" edc:name="RESRB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RESRB1" edc:desc="" edc:mask="0x1" edc:name="RESRB1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXB1DLC0" edc:desc="" edc:mask="0x1" edc:name="RXB1DLC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1DLC1" edc:desc="" edc:mask="0x1" edc:name="RXB1DLC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1DLC2" edc:desc="" edc:mask="0x1" edc:name="RXB1DLC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1DLC3" edc:desc="" edc:mask="0x1" edc:name="RXB1DLC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1RB0" edc:desc="" edc:mask="0x1" edc:name="RXB1RB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1RB1" edc:desc="" edc:mask="0x1" edc:name="RXB1RB1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXB1RTR" edc:desc="" edc:mask="0x1" edc:name="RXB1RTR" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB1D0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1D0" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF56">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB1D00" edc:desc="" edc:mask="0x1" edc:name="RXB1D00" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D01" edc:desc="" edc:mask="0x1" edc:name="RXB1D01" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D02" edc:desc="" edc:mask="0x1" edc:name="RXB1D02" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D03" edc:desc="" edc:mask="0x1" edc:name="RXB1D03" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D04" edc:desc="" edc:mask="0x1" edc:name="RXB1D04" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D05" edc:desc="" edc:mask="0x1" edc:name="RXB1D05" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D06" edc:desc="" edc:mask="0x1" edc:name="RXB1D06" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D07" edc:desc="" edc:mask="0x1" edc:name="RXB1D07" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB1D1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1D1" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF57">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB1D10" edc:desc="" edc:mask="0x1" edc:name="RXB1D10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D11" edc:desc="" edc:mask="0x1" edc:name="RXB1D11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D12" edc:desc="" edc:mask="0x1" edc:name="RXB1D12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D13" edc:desc="" edc:mask="0x1" edc:name="RXB1D13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D14" edc:desc="" edc:mask="0x1" edc:name="RXB1D14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D15" edc:desc="" edc:mask="0x1" edc:name="RXB1D15" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D16" edc:desc="" edc:mask="0x1" edc:name="RXB1D16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D17" edc:desc="" edc:mask="0x1" edc:name="RXB1D17" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB1D2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1D2" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF58">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB1D20" edc:desc="" edc:mask="0x1" edc:name="RXB1D20" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D21" edc:desc="" edc:mask="0x1" edc:name="RXB1D21" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D22" edc:desc="" edc:mask="0x1" edc:name="RXB1D22" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D23" edc:desc="" edc:mask="0x1" edc:name="RXB1D23" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D24" edc:desc="" edc:mask="0x1" edc:name="RXB1D24" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D25" edc:desc="" edc:mask="0x1" edc:name="RXB1D25" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D26" edc:desc="" edc:mask="0x1" edc:name="RXB1D26" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D27" edc:desc="" edc:mask="0x1" edc:name="RXB1D27" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="rrrrrrrr" edc:cname="RXB1D3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXB1D3" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xF59">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB1D30" edc:desc="" edc:mask="0x1" edc:name="RXB1D30" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D31" edc:desc="" edc:mask="0x1" edc:name="RXB1D31" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D32" edc:desc="" edc:mask="0x1" edc:name="RXB1D32" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D33" edc:desc="" edc:mask="0x1" edc:name="RXB1D33" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D34" edc:desc="" edc:mask="0x1" edc:name="RXB1D34" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D35" edc:desc="" edc:mask="0x1" edc:name="RXB1D35" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D36" edc:desc="" edc:mask="0x1" edc:name="RXB1D36" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1D37" edc:desc="" edc:mask="0x1" edc:name="RXB1D37" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="r" edc:stimregfiles="r" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
